In [93]:
import pandas as pd
import numpy as np

In [94]:
data= np.random.randn(4,3) # matris şeklinde 4*3 boyutunda numpy dizisi

In [95]:
data

array([[ 1.15994189,  0.9314962 , -0.18020234],
       [ 0.58830864,  0.57925915,  0.15381036],
       [-0.26899484, -0.12568482,  0.64325887],
       [ 0.72691485,  1.143803  , -1.67787145]])

In [96]:
dataFrame= pd.DataFrame(data)

In [97]:
dataFrame

          0         1         2
0  1.159942  0.931496 -0.180202
1  0.588309  0.579259  0.153810
2 -0.268995 -0.125685  0.643259
3  0.726915  1.143803 -1.677871

In [98]:
dataFrame[0] # sadece 1. sütun

0    1.159942
1    0.588309
2   -0.268995
3    0.726915
Name: 0, dtype: float64

In [99]:
type(dataFrame[0])

pandas.core.series.Series

In [100]:
dataFrame.loc[1,] # sadece 1. satır

0    0.588309
1    0.579259
2    0.153810
Name: 1, dtype: float64

In [101]:
yeniDataFrame=pd.DataFrame(data,
                           index=["Onur","Zeynep","Egemen","Ali"],
                           columns=["Maaş","Yaş","Çalışma Saati"])

In [102]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496      -0.180202
Zeynep  0.588309  0.579259       0.153810
Egemen -0.268995 -0.125685       0.643259
Ali     0.726915  1.143803      -1.677871

In [103]:
yeniDataFrame["Yaş"]

Onur      0.931496
Zeynep    0.579259
Egemen   -0.125685
Ali       1.143803
Name: Yaş, dtype: float64

In [104]:
yeniDataFrame["Çalışma Saati"]

Onur     -0.180202
Zeynep    0.153810
Egemen    0.643259
Ali      -1.677871
Name: Çalışma Saati, dtype: float64

In [105]:
yeniDataFrame[["Yaş","Maaş"]]

             Yaş      Maaş
Onur    0.931496  1.159942
Zeynep  0.579259  0.588309
Egemen -0.125685 -0.268995
Ali     1.143803  0.726915

In [106]:
yeniDataFrame.loc["Onur",] # sadece onurun özelliklerini almak için

Maaş             1.159942
Yaş              0.931496
Çalışma Saati   -0.180202
Name: Onur, dtype: float64

In [107]:
yeniDataFrame.loc["Ali"]

Maaş             0.726915
Yaş              1.143803
Çalışma Saati   -1.677871
Name: Ali, dtype: float64

In [108]:
yeniDataFrame.iloc[1]

Maaş             0.588309
Yaş              0.579259
Çalışma Saati    0.153810
Name: Zeynep, dtype: float64

In [109]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496      -0.180202
Zeynep  0.588309  0.579259       0.153810
Egemen -0.268995 -0.125685       0.643259
Ali     0.726915  1.143803      -1.677871

In [110]:
yeniDataFrame["Cinsiyet"]=[1,2,1,1]

In [111]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati  Cinsiyet
Onur    1.159942  0.931496      -0.180202         1
Zeynep  0.588309  0.579259       0.153810         2
Egemen -0.268995 -0.125685       0.643259         1
Ali     0.726915  1.143803      -1.677871         1

In [112]:
yeniDataFrame.drop("Cinsiyet",axis=1) # axis=1 eksen 1 yani sütun demek, axis=0 satır demek

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496      -0.180202
Zeynep  0.588309  0.579259       0.153810
Egemen -0.268995 -0.125685       0.643259
Ali     0.726915  1.143803      -1.677871

In [113]:
yeniDataFrame.drop(["Ali"]) # axis girilmezse otomatik 0 sayar

            Maaş       Yaş  Çalışma Saati  Cinsiyet
Onur    1.159942  0.931496      -0.180202         1
Zeynep  0.588309  0.579259       0.153810         2
Egemen -0.268995 -0.125685       0.643259         1

In [114]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati  Cinsiyet
Onur    1.159942  0.931496      -0.180202         1
Zeynep  0.588309  0.579259       0.153810         2
Egemen -0.268995 -0.125685       0.643259         1
Ali     0.726915  1.143803      -1.677871         1

In [115]:
yeniDataFrame.drop("Cinsiyet",axis=1,inplace=True)

In [116]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496      -0.180202
Zeynep  0.588309  0.579259       0.153810
Egemen -0.268995 -0.125685       0.643259
Ali     0.726915  1.143803      -1.677871

In [118]:
yeniDataFrame.loc["Onur"]

Maaş             1.159942
Yaş              0.931496
Çalışma Saati   -0.180202
Name: Onur, dtype: float64

In [119]:
yeniDataFrame.loc["Onur","Yaş"]

0.9314962010483231

In [121]:
yeniDataFrame.loc["Onur"]["Yaş"] # iki şekilde de kullanılabilir

0.9314962010483231

In [122]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496      -0.180202
Zeynep  0.588309  0.579259       0.153810
Egemen -0.268995 -0.125685       0.643259
Ali     0.726915  1.143803      -1.677871

In [128]:
df=yeniDataFrame>0

In [129]:
df

         Maaş    Yaş  Çalışma Saati
Onur     True   True          False
Zeynep   True   True           True
Egemen  False  False           True
Ali      True   True          False

In [130]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496      -0.180202
Zeynep  0.588309  0.579259       0.153810
Egemen -0.268995 -0.125685       0.643259
Ali     0.726915  1.143803      -1.677871

In [132]:
yeniDataFrame[df]

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496            NaN
Zeynep  0.588309  0.579259       0.153810
Egemen       NaN       NaN       0.643259
Ali     0.726915  1.143803            NaN

In [133]:
yeniDataFrame[yeniDataFrame>0]

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496            NaN
Zeynep  0.588309  0.579259       0.153810
Egemen       NaN       NaN       0.643259
Ali     0.726915  1.143803            NaN

In [134]:
yeniDataFrame[yeniDataFrame["Yaş"]>0] # sadece yaşı pozitifleri göster

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496      -0.180202
Zeynep  0.588309  0.579259       0.153810
Ali     0.726915  1.143803      -1.677871

In [135]:
yeniDataFrame[yeniDataFrame["Çalışma Saati"]>0] # çalışma saati 0 dan büyükleri göster

            Maaş       Yaş  Çalışma Saati
Zeynep  0.588309  0.579259       0.153810
Egemen -0.268995 -0.125685       0.643259

In [137]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496      -0.180202
Zeynep  0.588309  0.579259       0.153810
Egemen -0.268995 -0.125685       0.643259
Ali     0.726915  1.143803      -1.677871

In [138]:
yeniDataFrame.reset_index() # indexleri resetle

    index      Maaş       Yaş  Çalışma Saati
0    Onur  1.159942  0.931496      -0.180202
1  Zeynep  0.588309  0.579259       0.153810
2  Egemen -0.268995 -0.125685       0.643259
3     Ali  0.726915  1.143803      -1.677871

In [139]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati
Onur    1.159942  0.931496      -0.180202
Zeynep  0.588309  0.579259       0.153810
Egemen -0.268995 -0.125685       0.643259
Ali     0.726915  1.143803      -1.677871

In [141]:
yeniIndexListesi= ["On","Ze","Eg","Al"]

In [143]:
yeniDataFrame["Yeni Index"] =yeniIndexListesi

In [144]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati Yeni Index
Onur    1.159942  0.931496      -0.180202         On
Zeynep  0.588309  0.579259       0.153810         Ze
Egemen -0.268995 -0.125685       0.643259         Eg
Ali     0.726915  1.143803      -1.677871         Al

In [146]:
yeniDataFrame.set_index("Yeni Index")

                Maaş       Yaş  Çalışma Saati
Yeni Index
On          1.159942  0.931496      -0.180202
Ze          0.588309  0.579259       0.153810
Eg         -0.268995 -0.125685       0.643259
Al          0.726915  1.143803      -1.677871

In [147]:
yeniDataFrame

            Maaş       Yaş  Çalışma Saati Yeni Index
Onur    1.159942  0.931496      -0.180202         On
Zeynep  0.588309  0.579259       0.153810         Ze
Egemen -0.268995 -0.125685       0.643259         Eg
Ali     0.726915  1.143803      -1.677871         Al

In [148]:
yeniDataFrame.set_index("Yeni Index",inplace=True)

In [149]:
yeniDataFrame

                Maaş       Yaş  Çalışma Saati
Yeni Index
On          1.159942  0.931496      -0.180202
Ze          0.588309  0.579259       0.153810
Eg         -0.268995 -0.125685       0.643259
Al          0.726915  1.143803      -1.677871

In [150]:
yeniDataFrame.loc["On"]

Maaş             1.159942
Yaş              0.931496
Çalışma Saati   -0.180202
Name: On, dtype: float64

In [151]:
ilkIndeksler= ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [152]:
içIndeksler=["Homer","Bart","Marge","Cartmen","Keny","Kyle"]

In [153]:
birlesmisIndex=list(zip(ilkIndeksler,içIndeksler))

In [154]:
birlesmisIndex

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartmen'),
 ('South Park', 'Keny'),
 ('South Park', 'Kyle')]

In [156]:
birlesmisIndex=pd.MultiIndex.from_tuples(birlesmisIndex)

In [157]:
birlesmisIndex

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartmen'),
            ('South Park',    'Keny'),
            ('South Park',    'Kyle')],
           )

In [158]:
type(birlesmisIndex)

pandas.core.indexes.multi.MultiIndex

In [162]:
benimCizgiFilmListem= [[40,"A"],[10,"B"],[30,"C"],[11,"D"],[9,"E"],[10,"F"]]

In [164]:
cizgiFilmNumpyDizisi= np.array(benimCizgiFilmListem)

In [166]:
cizgiFilmDataFrame=pd.DataFrame(cizgiFilmNumpyDizisi,index=birlesmisIndex,columns=["Yas","Meslek"])

In [167]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartmen  11      D
           Keny      9      E
           Kyle     10      F

In [168]:
cizgiFilmDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [169]:
cizgiFilmDataFrame.loc["Simpson"].loc["Homer"]

Yas       40
Meslek     A
Name: Homer, dtype: object

In [170]:
cizgiFilmDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartmen  11      D
           Keny      9      E
           Kyle     10      F

In [171]:
cizgiFilmDataFrame.index.names=["Film Adı","İsim"]

In [172]:
cizgiFilmDataFrame

                   Yas Meslek
Film Adı   İsim
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartmen  11      D
           Keny      9      E
           Kyle     10      F